Revit 2024 API
RibbonButtonOptions Properties
The RibbonButtonOptions type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
RibbonButtonOptions Class
Autodesk.Revit.UI Namespace